Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་ཀྱི་བར་དུ་ནང་སྟོང་པ་ཉིད་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་གྱི་ཕྱིར་ཡོད་པ་མ་ཡིན་ནོ།
en: Similarly, it is owing to the emptiness of internal phenomena, and to [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, that [the causal attributes], up to and including the factors conducive to enlightenment, are nonexistent.

source: །སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཀྱི་བར་དུ་ནང་སྟོང་པ་ཉིད་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་གྱི་ཕྱིར་ཡོད་པ་མ་ཡིན་ནོ།
en: It is owing to the emptiness of internal phenomena, and to [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, that [the fruitional attributes], up to and including the eighteen distinct qualities of the buddhas, are nonexistent. “

source: །དེ་ལ་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་རྣམས་མེད་པ་ལ་མངོན་པར་ཞེན་པས། སྲིད་པ་ལ་མངོན་པར་ཞེན་ཏེ།
en: However, ordinary people, through their fixations on phenomena that are nonexistent, become fixated on their cravings.

source: དེ་དག་གིས་མེད་པ་ཡོངས་སུ་བརྟགས་པས། མེད་པ་ལ་མངོན་པར་ཞེན་ཅིང་འདི་ལྟ་སྟེ། ཆད་པ་དང་། རྟག་པའི་མཐའ་གཉིས་ལ་ཆགས་པས། དེ་དག་མི་ཤེས་མི་མཐོང་སྟེ།
en: By imagining phenomena that are nonexistent, they become fixated on that which is nonexistent, and through their adherence to the two extremes of eternalism and nihilism, they do not know and they do not see.

source: གང་མེད་པའི་ཆོས་དེ་དག་ཡོངས་སུ་བརྟགས་ནས། མིང་དང་གཟུགས་ལ་མངོན་པར་ཞེན་པ་དེ་དག་དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ལ་མངོན་པར་ཞེན་ཅིང་།
en: After imagining those phenomena that are nonexistent, they become fixated on the [psycho-physical aggregates that constitute] name and form.

source: སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ཀྱི་བར་ལ་མངོན་པར་ཞེན་ཏོ།
en: They become fixated on the applications of mindfulness, and they become fixated on [all the other causal and fruitional attributes], up to and including the eighteen distinct qualities of the buddhas.

source: །དེ་དག་དེ་ལྟར་མངོན་པར་ཞེན་པས་ཡོད་པ་མ་ཡིན་པའི་ཆོས་རྣམས་ལ་ཡོངས་སུ་རྟོག་སྟེ། དེ་དག་མི་ཤེས་མི་མཐོང་ངོ་།
en: Since, owing to their fixation on these phenomena, they imagine phenomena that are nonexistent, they do not know and they do not see.

source: །ཅི་མི་ཤེས་མི་མཐོང་ཞེ་ན། གཟུགས་མི་ཤེས་མི་མཐོང་ངོ་།
en: If you ask what they do not know and do not see, they neither know nor see physical forms.

source: །ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་མི་ཤེས་མི་མཐོང་ངོ་།
en: They neither know nor see feelings, perceptions, formative predispositions, or consciousness.

source: །སྐྱེ་མཆེད་དང་། ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་མི་ཤེས་མི་མཐོང་ངོ་།
en: They neither know nor see the sense fields, the sensory elements, or the links of dependent origination.

source: །བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་མི་ཤེས་མི་མཐོང་ངོ་། །སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ཀྱི་བར་དུ་མི་ཤེས་མི་མཐོང་ངོ་། །དེ་ལྟར་དེ་དག་ནི་བྱིས་པ་ཞེས་བྱ་བའི་གྲངས་སུ་འདོང་བ་སྟེ། དེ་དག་འབྱུང་བ་མ་ཡིན་ནོ། །གང་ནས་འབྱུང་བ་མ་ཡིན་ཞེ་ན།
en: They neither know nor see the thirty-seven factors conducive to enlightenment, They neither know nor see the [fruitional attributes], up to and including the eighteen distinct qualities of the buddhas. {

source: འདོད་པའི་ཁམས་ནས་འབྱུང་བ་མ་ཡིན་ནོ།
en: Dt.148} “In such ways, due to which they are counted among ‘ordinary people,’ they will not attain emancipation, and if you ask what it is that they will not be emancipated from, they will not be emancipated from the realm of desire.

source: །གཟུགས་ཀྱི་ཁམས་ནས་འབྱུང་བ་མ་ཡིན་ནོ།
en: They will not be emancipated from the realm of form.

source: །གཟུགས་མེད་པའི་ཁམས་ནས་འབྱུང་བ་མ་ཡིན་ནོ།
en: They will not be emancipated from the realm of formlessness.

source: །ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱི་ས་ནས་འབྱུང་བ་མ་ཡིན་ནོ།
en: They will not be emancipated from the levels of the śrāvakas or the pratyekabuddhas.

source: །དེ་དག་ནི་ཡིད་མི་ཆེས་པ་སྟེ།
en: They lack conviction.

source: ཇི་ལྟར་ཡིད་མི་ཆེས་ཞེ་ན། གཟུགས་གཟུགས་ཀྱིས་སྟོང་ཞེས་བྱ་བར་ཡིད་མི་ཆེས་སོ།
en: If you ask how they lack conviction, they lack the conviction that physical forms are empty of physical forms.

source: །བྱང་ཆུབ་ཀྱི་བར་དུ་བྱང་ཆུབ་ཀྱིས་སྟོང་ཞེས་བྱ་བར་ཡིད་མི་ཆེས་སོ།
en: They lack the conviction that [all phenomena and attainments], up to and including enlightenment, are empty of enlightenment [and so forth].

source: །དེ་དག་ནི་གནས་པ་མ་ཡིན་པ་སྟེ།
en: Also, they are not stable.

source: ཇི་ལྟར་གནས་པ་མ་ཡིན་ཞེ་ན། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་པ་མ་ཡིན།
en: If you ask what it is in which they are not stable, they are not stable in the perfection of generosity.

source: ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་པ་མ་ཡིན།
en: They are not stable in the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, or the perfection of wisdom.

source: ཕྱིར་མི་ལྡོག་པའི་ས་ལ་གནས་པ་མ་ཡིན། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ཀྱི་བར་ལ་གནས་པ་མ་ཡིན་ནོ། །དེ་དག་ནི་མངོན་པར་ཞེན་པ་མ་ཡིན་ཏེ།
en: They are not stable in the irreversible [sublime] levels, and they are not stable in [the causal and fruitional attributes], up to and including the eighteen distinct attributes of the buddhas.

source: ཇི་ལྟར་མངོན་པར་ཞེན་པ་ཡིན་ཞེ་ན།
en: They are said to be ‘fixated.’

source: གཟུགས་ལ་མངོན་པར་ཞེན་པ་ཡིན། ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ལ་མངོན་པར་ཞེན་པ་ཡིན།
en: If you ask how they are fixated, they are fixated on physical forms, and they are fixated on feelings, perceptions, formative predispositions, and consciousness.

source: མིག་ལ་མངོན་པར་ཞེན་པ་ཡིན། རྣ་བ་དང་། སྣ་དང་། ལྕེ་དང་། ལུས་དང་། ཡིད་ལ་མངོན་པར་ཞེན་པ་ཡིན།
en: They are fixated on the eyes, and they are fixated on the ears, the nose, the tongue, the body, and the mental faculty.

source: སྐྱེ་མཆེད་དང་། ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་ལ་མངོན་པར་ཞེན་པ་ཡིན།
en: They are fixated on the sense fields, the sensory elements, and the links of dependent origination.

source: འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་ལ་མངོན་པར་ཞེན་པ་ཡིན།
en: They are fixated on desire, hatred, and delusion.

source: ལྟ་བར་གྱུར་པ་རྣམས་ལ་མངོན་པར་ཞེན་པ་ཡིན།
en: They are fixated on opinions.

source: བྱང་ཆུབ་ཀྱི་བར་ལ་མངོན་པར་ཞེན་པ་ཡིན་ཏེ།
en: They are fixated on the [attributes and attainments], up to and including enlightenment.

source: དེའི་ཕྱིར་ན་བྱིས་པ་ཞེས་བྱའོ།
en: That is why they are called ‘ordinary people.’ ” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་ལྟར་སློབ་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་མི་སློབ་ཅིང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་མི་འབྱུང་བ་ལགས་སམ།
en: Blessed Lord, are bodhisattva great beings who train in such ways not training in the perfection of wisdom, and will they not be emancipated in all-aspect omniscience?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་དེ་ལྟར་སློབ་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་མི་སློབ་པ་ཡིན། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་མི་འབྱུང་བ་ཡིན་ནོ།
en: Śāradvatīputra,” replied the Blessed One, “bodhisattva great beings who train in such ways are not training in the perfection of wisdom, and they will not be emancipated in all-aspect omniscience.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་ཅིའི་སླད་དུ་བྱང་ཆུབ་སེམས་དཔའ་དེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་མི་སློབ་པ་ལགས། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་མི་འབྱུང་བ་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, why are those bodhisattvas not training in the perfection of wisdom, and why will they not be emancipated in all-aspect omniscience?” “

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐབས་མི་མཁས་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བརྟགས་ཤིང་མངོན་པར་ཞེ་ན། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་།
en: Śāradvatīputra,” replied the Blessed One, “bodhisattva great beings who are unskillful have conceived of and become fixated on the perfection of wisdom.

source: བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བརྟགས་ཤིང་མངོན་པར་ཞེ་ན། སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་དང་། ཡང་དག་པར་སྤོང་བ་རྣམས་དང་།
en: They have conceived of and become fixated on the perfection of meditative concentration, the perfection of perseverance, the perfection of tolerance, the perfection of ethical discipline, and the perfection of generosity.

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་རྣམས་དང་། དབང་པོ་རྣམས་དང་། སྟོབས་རྣམས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམས་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ལ་བརྟགས་ཤིང་མངོན་པར་ཞེ་ན། འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་བ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་།
en: They have conceived of and become fixated on all the aspects of emptiness, the applications of mindfulness, the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path.

source: གཟུངས་ཀྱི་སྒོ་རྣམས་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ལ་བརྟགས་ཤིང་མངོན་པར་ཞེན།
en: They have conceived of and become fixated on the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the gateways of the meditative stabilities and the dhāraṇīs, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, and the eighteen distinct qualities of the buddhas.

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ལ་བརྟགས་ཤིང་མངོན་པར་ཞེན་པས།
en: They have conceived of and become fixated on [the attainments], up to and including all-aspect omniscience.

source: ཤ་ར་དྭ་ཏིའི་བུ་རྣམ་གྲངས་དེས་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་མི་སློབ་པ་ཡིན། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་མི་འབྱུང་བ་ཡིན་ནོ། །གསོལ་པ།
en: Śāradvatīputra, those are the formulations explaining how bodhisattva great beings do not train in the perfection of wisdom, and how they will not be emancipated in all-aspect omniscience.” {

source: བཅོམ་ལྡན་འདས་དེ་ལྟ་ལགས་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་རྣམ་པ་གང་གིས་སློབ་པར་འགྱུར་བ་ལགས། ཇི་ལྟར་བསླབས་ན་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་འབྱུང་བ་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་ནམ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ།
en: Dt.149} “Blessed Lord, in that case, by what means do bodhisattva great beings train in the perfection of wisdom, and, by training accordingly, how do they become emancipated in all-aspect omniscience?” “

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དེ་མི་དམིགས། ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ཞིང་། ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་དེ་ལྟར་སྤྱོད་ན། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་མི་དམིགས་པའི་ཚུལ་གྱིས་འབྱུང་བ་ཡིན་ནོ། །བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་།
en: Śāradvatīputra,” replied the Blessed One, “when bodhisattva great beings practice the perfection of wisdom, they do not apprehend and do not observe the perfection of wisdom, and, Śāradvatīputra, when bodhisattva great beings practice the perfection of wisdom in that manner, they do not apprehend and do not observe all-aspect omniscience.

source: བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དེ་མི་དམིགས་ཤིང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་།
en: When bodhisattva great beings practice the perfection of meditative concentration, the perfection of perseverance, the perfection of tolerance, the perfection of ethical discipline, and the perfection of generosity, they do not apprehend and do not observe the perfection of generosity [and so forth].

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ལ་སྤྱོད་པའི་ཚེ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དེ་མི་དམིགས། ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ཞིང་།
en: When they practice [the other attributes and attainments], up to and including all-aspect omniscience, they do not apprehend and do not observe all-aspect omniscience.

source: ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་དེ་ལྟར་སློབ་པ་ནི། མི་དམིགས་པའི་ཚུལ་གྱིས་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་འབྱུང་ངོ་།
en: Śāradvatīputra, bodhisattva great beings who train in the perfection of wisdom in that manner will be emancipated in all-aspect omniscience, without apprehending anything.

source: །ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པ་དང་། དེ་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སློབ་པ་ནི། མི་དམིགས་པའི་ཚུལ་གྱིས་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་འབྱུང་ངོ་།
en: Śāradvatīputra, bodhisattva great beings who practice the perfection of wisdom in that manner, and train in the perfection of wisdom in that manner, will be emancipated in all-aspect omniscience, without apprehending anything.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་གང་མི་དམིགས་པའི་ཚུལ་གྱིས་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་འབྱུང་བ་ལགས།
en: Blessed Lord,” he asked, “With respect to what will they be emancipated in all-aspect omniscience, without apprehending anything?” {

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ནང་སྟོང་པ་ཉིད་མི་དམིགས་པའི་ཚུལ་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་མི་དམིགས་པའི་ཚུལ་གྱིས་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་འབྱུང་བར་ཤེས་པར་བྱའོ།
en: Dt.150} The Blessed One replied, “You should know that they will be emancipated in all-aspect omniscience without apprehending anything with respect to the emptiness of internal phenomena, and, without apprehending anything with respect to [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities.”

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ་ལས་ལེའུ་དྲུག་པའོ།། །།
en: This completes the sixth chapter from “The Perfection of Wisdom in Twenty-Five Thousand Lines.”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ལ་ལ་ཞིག་འདི་སྐད་དུ་འདྲི་ཞིང་། ཅི་སྒྱུ་མའི་སྐྱེས་བུ་འདི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབས་ཤིང་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་འབྱུང་བར་འགྱུར་རམ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་འགྱུར་རམ་ཞེས་མཆི་ན།
en: Chapter 7 Then the venerable Subhūti inquired of the Blessed One, “Blessed Lord, suppose someone were to ask if this illusory person, after training in the perfection of wisdom, will be emancipated in all-aspect omniscience, or if he or she will attain all-aspect omniscience. {

source: བཅོམ་ལྡན་འདས་དེ་སྐད་དུ་འདྲི་བ་དེ་ལ་ཇི་སྐད་དུ་བསྟན་པར་བགྱི། ཅི་སྒྱུ་མའི་སྐྱེས་བུ་འདི་བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་།
en: Dt.151} Blessed Lord, how should I respond to that question?

source: བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབས་ཤིང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་འབྱུང་བར་འགྱུར་རམ། ཅི་སྒྱུ་མའི་སྐྱེས་བུ་འདི་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་ཀྱི་བར་ལ་བསླབས་ཤིང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་འབྱུང་བར་འགྱུར་རམ། སྒྱུ་མའི་སྐྱེས་བུ་འདི་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ཀྱི་བར་ལ་བསླབས་ཤིང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་འབྱུང་བར་འགྱུར་རམ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་འགྱུར་རམ་ཞེས་མཆི་ན།
en: Suppose someone were to ask if this illusory person, after training in the perfection of meditative concentration, the perfection of perseverance, the perfection of tolerance, the perfection of ethical discipline, and the perfection of generosity, will be emancipated in all-aspect omniscience; or if this illusory person, after training in [the causal attributes], up to and including the factors conducive to enlightenment, will be emancipated in all-aspect omniscience; or if this illusory person, after training in [the fruitional attributes], up to and including the eighteen distinct qualities of the buddhas, will be emancipated in all-aspect omniscience, or if he or she will attain all-aspect omniscience.

source: བཅོམ་ལྡན་འདས་དེ་སྐད་དུ་འདྲི་བ་དེ་ལ་ཇི་སྐད་དུ་བསྟན་པར་བགྱི། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, how should I respond to such questioning?” “

source: རབ་འབྱོར་དེ་ལྟ་བས་ན། དེ་ཁྱོད་ཉིད་ལ་དྲིས་ཁྱོད་ཀྱིས་ཇི་ལྟར་བཟོད་པ་དེ་ལྟར་ལུང་སྟོན་ཅིག །
en: Subhūti,” replied the Blessed One, “in that case, I will ask you a counter-question, which you may answer as best you can.

source: རབ་འབྱོར་དེ་ཇི་སྙམ་དུ་སེམས། གཟུགས་ཀྱང་གཞན་ལ། སྒྱུ་མ་ཡང་གཞན་ཞིག་ཡིན་སྙམ་འམ། ཚོར་བའམ། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ཡང་གཞན་ལ། སྒྱུ་མ་ཡང་གཞན་ཞིག་ཡིན་སྙམ་འམ།
en: Subhūti, do you think that physical forms are one thing, and that illusions are another, or do you think that feelings, perceptions, formative predispositions, and consciousness are one thing, and that illusions are another?” “

source: གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་ལྟ་མ་ལགས་སོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་དེ་ཇི་སྙམ་དུ་སེམས། མིག་ཀྱང་གཞན་ལ། སྒྱུ་མ་ཡང་གཞན་ཞིག་ཡིན་སྙམ་འམ། རྣ་བ་དང་། སྣ་དང་། ལྕེ་དང་། ལུས་དང་། ཡིད་ཀྱང་གཞན་ལ། སྒྱུ་མ་ཡང་གཞན་ཞིག་ཡིན་སྙམ་འམ། གཟུགས་ཀྱང་གཞན་ལ། སྒྱུ་མ་ཡང་གཞན་ཞིག་ཡིན་སྙམ་འམ། སྒྲ་དང་། དྲི་དང་། རོ་དང་། རེག་དང་། ཆོས་ཀྱང་གཞན་ལ། སྒྱུ་མ་ཡང་གཞན་ཞིག་ཡིན་སྙམ་འམ། མིག་གི་རྣམ་པར་ཤེས་པ་ཡང་གཞན་ལ། སྒྱུ་མ་ཡང་གཞན་ཞིག་ཡིན་སྙམ་འམ། རྣ་བའི་རྣམ་པར་ཤེས་པ་དང་། སྣའི་རྣམ་པར་ཤེས་པ་དང་། ལྕེའི་རྣམ་པར་ཤེས་པ་དང་། ལུས་ཀྱི་རྣམ་པར་ཤེས་པ་དང་། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པ་ཡང་གཞན་ལ། སྒྱུ་མ་ཡང་གཞན་ཞིག་ཡིན་སྙམ་འམ། མིག་གི་འདུས་ཏེ་རེག་པ་ཡང་གཞན་ལ། སྒྱུ་མ་ཡང་གཞན་ཞིག་ཡིན་སྙམ་འམ། རྣ་བའི་འདུས་ཏེ་རེག་པ་དང་། སྣའི་འདུས་ཏེ་རེག་པ་དང་། ལྕེའི་འདུས་ཏེ་རེག་པ་དང་། ལུས་ཀྱི་འདུས་ཏེ་
en: No, Blessed Lord!”

source: རེག་པ་དང་། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པ་ཡང་གཞན་ལ།
en: he replied.

source: སྒྱུ་མ་ཡང་གཞན་ཞིག་ཡིན་སྙམ་འམ། མིག་གི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་ཡང་གཞན་ལ། སྒྱུ་མ་ཡང་གཞན་ཞིག་ཡིན་སྙམ་འམ། རྣ་བའི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་། སྣའི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་། ལྕེའི་འདུས་ཏེ་རེ
en: The Blessed One then asked, “Subhūti, do you think that the eyes are one thing and that illusions are another; or do you think that the ears, nose, tongue, body, and mental faculty are one thing and illusions another; or do you think that sights are one thing and illusions another; or do you think that sounds, odors, tastes, tangibles, and mental phenomena are one thing and illusions another; or do you think that visual consciousness is one thing and illusions another; or do you think that auditory consciousness, olfactory consciousness, gustatory consciousness, tactile consciousness, and mental consciousness are one thing and illusions another; or do you think that visually compounded sensory contact is one thing and illusions another, or do you think that aurally compounded sensory contact, nasally compounded sensory contact, lingually compounded sensory contact, corporeally compounded sensory contact, and mentally compounded sensory contact are one thing and illusions another; or do you think that feelings conditioned by visually compounded sensory contact are one thing and illusions another; or do you think that feelings conditioned by aurally compounded sensory contact, feelings conditioned by nasally compounded sensory contact, feelings conditioned by lingually compounded sensory contact, feelings conditioned by corporeally compounded sensory contact, and feelings conditioned by mentally compounded sensory contact are one thing and illusions another?” {

source: ག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་། ལུས་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་ཡང་གཞན་ལ། སྒྱུ་མ་ཡང་གཞན་ཞིག་ཡིན་སྙམ་འམ། གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་ལྟ་མ་ལགས་སོ།
en: Dt.152} “No, Blessed Lord!”

source: རབ་འབྱོར་དེ་ཇི་སྙམ་དུ་སེམས། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་ཀྱི་བར་ཡང་གཞན་ལ། སྒྱུ་མ་ཡང་གཞན་ཞིག་ཡིན་སྙམ་འམ།
en: Subhūti, do you think that [the causal attributes], up to and including the factors conducive to enlightenment, are one thing and illusions another?”

source: གསོལ་པ།
en: asked the Blessed One. “

source: བཅོམ་ལྡན་འདས་དེ་ལྟ་མ་ལགས་སོ།
en: No, Blessed Lord!”

source: རབ་འབྱོར་དེ་ཇི་སྙམ་དུ་སེམས། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཀྱི་བར་ཡང་གཞན་ལ། སྒྱུ་མ་ཡང་གཞན་ཞིག་ཡིན་སྙམ་འམ།
en: Dt.153} “Subhūti, do you think that [the fruitional attributes], up to and including the eighteen distinct qualities of the buddhas, are one thing and illusions another?”

source: རབ་འབྱོར་དེ་ཇི་སྙམ་དུ་སེམས། བྱང་ཆུབ་ཀྱང་གཞན་ལ། སྒྱུ་མ་ཡང་གཞན་ཞིག་ཡིན་སྙམ་འམ།
en: Subhūti, do you think that enlightenment is one thing and illusions another?”

source: །བཅོམ་ལྡན་འདས་གཟུགས་ཀྱང་གཞན་མ་ལགས། སྒྱུ་མ་ཡང་གཞན་མ་ལགས་ཏེ།
en: Blessed Lord, physical forms are not one thing and illusions another.

source: གཟུགས་ཉིད་ཀྱང་སྒྱུ་མ། སྒྱུ་མ་ཉིད་ཀྱང་གཟུགས་སོ།
en: Physical forms are themselves illusion, and illusion itself is physical forms.

source: །བཅོམ་ལྡན་འདས་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ཡང་གཞན་མ་ལགས། སྒྱུ་མ་ཡང་གཞན་མ་ལགས་ཏེ།
en: Blessed Lord, feelings, perceptions, formative predispositions, and consciousness are not one thing and illusions another.

source: རྣམ་པར་ཤེས་པ་ཉིད་ཀྱང་སྒྱུ་མ། སྒྱུ་མ་ཉིད་ཀྱང་རྣམ་པར་ཤེས་པའོ།
en: Consciousness [and the aforementioned aggregates] are themselves illusion, and illusion itself is consciousness [and the aforementioned aggregates].

source: །བཅོམ་ལྡན་འདས་མིག་ཀྱང་གཞན་མ་ལགས། སྒྱུ་མ་ཡང་གཞན་མ་ལགས་ཏེ།
en: Blessed Lord, the eyes are not one thing and illusions another.

source: མིག་ཉིད་ཀྱང་སྒྱུ་མ། སྒྱུ་མ་ཉིད་ཀྱང་མིག་གོ།
en: The eyes themselves are illusion, and illusion itself is the eyes.

source: །བཅོམ་ལྡན་འདས་རྣ་བ་དང་། སྣ་དང་། ལྕེ་དང་། ལུས་དང་། ཡིད་ཀྱང་གཞན་མ་ལགས།
en: Blessed Lord, the ears, nose, tongue, body, and mental faculty are not one thing and illusions another.

source: སྒྱུ་མ་ཡང་གཞན་མ་ལགས་ཏེ། ཡིད་ཉིད་ཀྱང་སྒྱུ་མ། སྒྱུ་མ་ཉིད་ཀྱང་ཡིད་དོ།
en: The mental faculty [and so forth] are themselves illusion, and illusion itself is the mental faculty [and so forth].

source: །བཅོམ་ལྡན་འདས་སྒྲ་དང་། དྲི་དང་། རོ་དང་། རེག་དང་། ཆོས་ཀྱང་གཞན་མ་ལགས།
en: Blessed Lord, sounds, odors, tastes, tangibles, and mental phenomena are not one thing and illusions another.

source: སྒྱུ་མ་ཡང་གཞན་མ་ལགས་ཏེ། ཆོས་ཉིད་ཀྱང་སྒྱུ་མ།
en: Mental phenomena [and so forth] are themselves illusion, and illusion itself is mental phenomena [and so forth].

source: སྒྱུ་མ་ཉིད་ཀྱང་ཆོས་སོ། །བཅོམ་ལྡན་འདས་མིག་གི་རྣམ་པར་ཤེས་པ་ཡང་གཞན་མ་ལགས། སྒྱུ་མ་ཡང་གཞན་མ་ལགས་ཏེ།
en: Blessed Lord, visual consciousness is not one thing and illusions another.

source: མིག་གི་རྣམ་པར་ཤེས་པ་ཉིད་ཀྱང་སྒྱུ་མ། སྒྱུ་མ་ཉིད་ཀྱང་མིག་གི་རྣམ་པར་ཤེས་པའོ།
en: Visual consciousness itself is illusion, and illusion itself is visual consciousness.

source: །བཅོམ་ལྡན་འདས་རྣ་བའི་རྣམ་པར་ཤེས་པ་དང་། སྣའི་རྣམ་པར་ཤེས་པ་དང་། ལྕེའི་རྣམ་པར་ཤེས་པ་དང་། ལུས་ཀྱི་རྣམ་པར་ཤེས་པ་དང་། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པ་ཡང་གཞན་མ་ལགས།
en: Blessed Lord, auditory consciousness, olfactory consciousness, gustatory consciousness, tactile consciousness, and mental consciousness are not one thing and illusions another.

source: སྒྱུ་མ་ཡང་གཞན་མ་ལགས་ཏེ། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པ་ཉིད་ཀྱང་སྒྱུ་མ། སྒྱུ་མ་ཉིད་ཀྱང་ཡིད་ཀྱི་རྣམ་པར་ཤེས་པའོ།
en: Mental consciousness [and so forth] are themselves illusion, and illusion itself is mental consciousness [and so forth].

source: །བཅོམ་ལྡན་འདས་མིག་གི་འདུས་ཏེ་རེག་པ་ཡང་གཞན་མ་ལགས། སྒྱུ་མ་ཡང་གཞན་མ་ལགས་ཏེ།
en: Blessed Lord, visually compounded sensory contact is not one thing and illusions another.

source: མིག་གི་འདུས་ཏེ་རེག་པ་ཉིད་ཀྱང་སྒྱུ་མ། སྒྱུ་མ་ཉིད་ཀྱང་མིག་གི་འདུས་ཏེ་རེག་པའོ།
en: Visually compounded sensory contact is itself illusion, and illusion itself is visually compounded sensory contact.

source: །བཅོམ་ལྡན་འདས་རྣ་བའི་འདུས་ཏེ་རེག་པ་དང་། སྣའི་འདུས་ཏེ་རེག་པ་དང་། ལྕེའི་འདུས་ཏེ་རེག་པ་དང་། ལུས་ཀྱི་འདུས་ཏེ་རེག་པ་དང་། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པ་ཡང་གཞན་མ་ལགས།
en: Blessed Lord, aurally compounded sensory contact, nasally compounded sensory contact, lingually compounded sensory contact, corporeally compounded sensory contact, and mentally compounded sensory contact are not one thing and illusions another.
